241009-version/emacs/config.org
#+TITLE: Configuración de Emacs
#+AUTHOR: Antonio Moreno (ammz)


* Emacs early-init.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle ~/.config/emacs/early-init.el
:END:

Incrementa el límite antes de lanzar el recolector de basura para arrancar más rápido:

 #+begin_src emacs-lisp
  (setq gc-cons-threshold (* 200 1000 1000))
 #+end_src

Deshabilitamos toolbar, menubar y scrollbar

#+begin_src emacs-lisp
  (tool-bar-mode 0)
  (menu-bar-mode 0)
  (scroll-bar-mode 0)
#+end_src

Deshabilita que los paquetes instalados estén disponibles al arrancar

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src

No redimensiona la ventana cuando se cambia la fuente al inicio para evitar retraso:

#+begin_src emacs-lisp
  (setq frame-inhibit-implied-resize t)
  #+end_src

Configuración de la ventana de inicio

#+begin_src emacs-lisp
  (setq default-frame-alist
        (append
         (list
          '(undecorated . t)
          '(min-height . 1)
          '(height     . 42)
          '(min-width  . 1)
          '(width      . 170)
          '(vertical-scroll-bars . nil)
          '(internal-border-width . 10)
          '(tool-bar-lines . 0)
          '(menu-bar-lines . 0))))
#+end_src

Frame margin settings don't affect windows: in a vertical split, the text of the right window has no margin with the window edge on the left.
Therefore also set window margins for aesthetic consistency.

#+begin_src emacs-lisp
  (setq-default left-margin-width 1
                right-margin-width 1)
#+end_src

* Emacs init.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle ~/.config/emacs/init.el
:END:

** Instalador de paquetes
*** Elpaca Package Manager

Esta sección viene al principio ya que el resto de secciones usarán =use-package= y =elpaca= para la gestión de paquetes

Se pueden hacer instalaciones de un solo uso (/ej/ para testar) con ~elpaca-try~.

#+begin_src emacs-lisp :results none
  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                   ,@(when-let ((depth (plist-get order :depth)))
                                                       (list (format "--depth=%d" depth) "--no-single-branch"))
                                                   ,(plist-get order :repo) ,repo))))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

=use-package= y =elpaca= se integran bien. Con =use-package-always-ensure= no hay que incluir =:ensure t= para que los paquetes se instalen si no lo están.

#+begin_src emacs-lisp :results none
  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode)
    (setq use-package-always-ensure t))

  ;; Block until current queue processed.
  (elpaca-wait)
#+end_src

** Org mode

Usamos =noweb= (sintaxis =<<placeholder>>=) para poder referenciar a otros bloques para mejorar la claridad y organización de la configuración

#+BEGIN_SRC emacs-lisp :noweb no-export
  (use-package org
    :ensure nil
    :init (require 'org)
    :after ox
    :config
    <<org-config>>
    :bind
    ("C-c a" . org-agenda)
    ("C-c c" . org-capture)
    ("C-c b" . org-switchb)
    ("C-c t" . org-toggle-link-display)
    ("C-c l" . org-store-link)
    :hook
    (org-mode . visual-line-mode))
  (elpaca-wait)
#+END_SRC

*** Variables 

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-startup-indented t         ;indentación de cabeceras
        org-list-allow-alphabetical t  ;listas numeradas alfabéticamente
        org-attach-use-inheritance t 
        org-ellipsis " »"
        org-startup-folded t   ;Inicio todo plegado
        org-hide-emphasis-markers t)   ;Oculta los marcadores de formato

  (setq-default org-fold-catch-invisible-edits 'smart)
#+end_src

*** Plantillas de captura

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-capture-templates
        '(("o" "TODO vencimiento" entry
           (file+headline "~/Sync/org/inbox.org" "tareas")
           "* TODO %?\nDEADLINE: %^{fecha tope}t")
          ("t" "TODO" entry
           (file+headline "~/Sync/org/inbox.org" "tareas")
           "* TODO %?\n")
          ("n" "Nota" entry
           (file+headline "~/Sync/org/inbox.org" "notas")
           "* %?\n%c")
          ("h" "Nota alerta" entry
           (file+headline "~/proyectos/hugo-sge/content-org/pie.org" "notas de alerta")
           (function org-hugo-new-subtree-post-capture-template)
           :prepend t)
          ("r" "Recordatorio" entry
           (file "~/Sync/org/recuerda.org")
           "* %?\n %^t")
          ("d" "Diario" entry
           (file+olp+datetree "~/Sync/org/diario.org")
           "** %?" :time-prompt t)
          ("R" "Reunion" entry
           (file+headline "~/Sync/org/inbox.org" "reuniones")
           "* %? :reunion:\n%^t %^{lugar}p")
          ("i" "Informe" entry
           (file+headline "~/Sync/org/informes.org" "2019")
           "* TODO %? %^g\n:PROPERTIES:\n
                              :solicitante: %^{solicitante|sge|sgt|vice}\n
                              :f_entrada: %^u\n
                              :f_respuesta: \n:end:\n")))
#+end_src

*** Refile. Relocalización de los encabezamientos/tareas.

Scanea los target de refile en los archivos de la agenda. Aumenta los niveles en los que encontrar posibles encabezamientos para reasignar tareas. Por defecto son sólo 3.

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-refile-targets (quote ((nil :maxlevel . 6)
                                   (org-agenda-files :maxlevel . 6))))
#+end_src

Establece como archivar los ficheros org

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-archive-location "archivador/%s_archive::")
#+end_src

*** TODO

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-todo-keywords
        '((sequence "TODO" "NEXT" "WAITING" "|" "DONE" "CANCEL")))
#+end_src

*** Exportación

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-export-default-language "es")
  (setq org-export-date-timestamp-format "%d de %b %y")
  (setq org-export-allow-bind-keywords t)
#+end_src

*** icalendar

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-icalendar-combined-agenda-file "/usr/local/var/www/org.ics")
  (setq org-icalendar-store-uid t)
  (setq org-icalendar-include-todo t)
  (setq org-icalendar-use-deadline '(event-if-todo))
  (setq org-icalendar-use-scheduled '(event-if-todo))
#+end_src

*** Bloques

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (setq org-structure-template-alist
        '(("s" . "SRC")
          ("e" . "SRC emacs-lisp")
          ("E" . "EXAMPLE")
          ("q" . "QUOTE")
          ("v" . "VERSE")
          ("V" . "VERBATIM")
          ("c" . "CENTER")
          ("C" . "COMMENT")))

  (use-package org-tempo
    :ensure nil
    :init (require 'org-tempo))
#+end_src

*** Bloques de código

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  ;; Ejecuta bloques de código sin pedir confirmación
  (setq org-confirm-babel-evaluate nil)
  ;; Ejecuta los bloques de código al salvar el archivo
  (add-hook 'after-save-hook 'org-babel-tangle)
#+end_src

*** Lenguajes cargados para usar con org babel

#+begin_src emacs-lisp :tangle no :noweb-ref org-config
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (ditaa . t)
     (calc . t)
     (lisp . t)
     (scheme . t)
     (haskell . t)
     (latex . t)
     (js . t)
     (makefile . t)
     (C . t)))
#+end_src

