241009-version/emacs/init.el
(defvar elpaca-installer-version 0.7)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                 ,@(when-let ((depth (plist-get order :depth)))
                                                     (list (format "--depth=%d" depth) "--no-single-branch"))
                                                 ,(plist-get order :repo) ,repo))))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install use-package support
(elpaca elpaca-use-package
  ;; Enable use-package :ensure support for Elpaca.
  (elpaca-use-package-mode)
  (setq use-package-always-ensure t))

;; Block until current queue processed.
(elpaca-wait)

(use-package org
  :ensure nil
  :init (require 'org)
  :after ox
  :config
  (setq org-startup-indented t         ;indentación de cabeceras
        org-list-allow-alphabetical t  ;listas numeradas alfabéticamente
        org-attach-use-inheritance t 
        org-ellipsis " »"
        org-startup-folded t   ;Inicio todo plegado
        org-hide-emphasis-markers t)   ;Oculta los marcadores de formato
  
  (setq-default org-fold-catch-invisible-edits 'smart)
  (setq org-capture-templates
        '(("o" "TODO vencimiento" entry
           (file+headline "~/Sync/org/inbox.org" "tareas")
           "* TODO %?\nDEADLINE: %^{fecha tope}t")
          ("t" "TODO" entry
           (file+headline "~/Sync/org/inbox.org" "tareas")
           "* TODO %?\n")
          ("n" "Nota" entry
           (file+headline "~/Sync/org/inbox.org" "notas")
           "* %?\n%c")
          ("h" "Nota alerta" entry
           (file+headline "~/proyectos/hugo-sge/content-org/pie.org" "notas de alerta")
           (function org-hugo-new-subtree-post-capture-template)
           :prepend t)
          ("r" "Recordatorio" entry
           (file "~/Sync/org/recuerda.org")
           "* %?\n %^t")
          ("d" "Diario" entry
           (file+olp+datetree "~/Sync/org/diario.org")
           "** %?" :time-prompt t)
          ("R" "Reunion" entry
           (file+headline "~/Sync/org/inbox.org" "reuniones")
           "* %? :reunion:\n%^t %^{lugar}p")
          ("i" "Informe" entry
           (file+headline "~/Sync/org/informes.org" "2019")
           "* TODO %? %^g\n:PROPERTIES:\n
                              :solicitante: %^{solicitante|sge|sgt|vice}\n
                              :f_entrada: %^u\n
                              :f_respuesta: \n:end:\n")))
  (setq org-refile-targets (quote ((nil :maxlevel . 6)
                                   (org-agenda-files :maxlevel . 6))))
  (setq org-archive-location "archivador/%s_archive::")
  (setq org-todo-keywords
        '((sequence "TODO" "NEXT" "WAITING" "|" "DONE" "CANCEL")))
  (setq org-export-default-language "es")
  (setq org-export-date-timestamp-format "%d de %b %y")
  (setq org-export-allow-bind-keywords t)
  (setq org-icalendar-combined-agenda-file "/usr/local/var/www/org.ics")
  (setq org-icalendar-store-uid t)
  (setq org-icalendar-include-todo t)
  (setq org-icalendar-use-deadline '(event-if-todo))
  (setq org-icalendar-use-scheduled '(event-if-todo))
  (setq org-structure-template-alist
        '(("s" . "SRC")
          ("e" . "SRC emacs-lisp")
          ("E" . "EXAMPLE")
          ("q" . "QUOTE")
          ("v" . "VERSE")
          ("V" . "VERBATIM")
          ("c" . "CENTER")
          ("C" . "COMMENT")))
  
  (use-package org-tempo
    :ensure nil
    :init (require 'org-tempo))
  ;; Ejecuta bloques de código sin pedir confirmación
  (setq org-confirm-babel-evaluate nil)
  ;; Ejecuta los bloques de código al salvar el archivo
  (add-hook 'after-save-hook 'org-babel-tangle)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (ditaa . t)
     (calc . t)
     (lisp . t)
     (scheme . t)
     (haskell . t)
     (latex . t)
     (js . t)
     (makefile . t)
     (C . t)))
