241009-version/emacs/init.el
  (add-to-list 'org-file-apps '("\\.odt?\\'" . "xdg-open %s"))
  (add-to-list 'org-file-apps '("\\.ods?\\'" . "xdg-open %s"))
  (add-to-list 'org-file-apps '("\\.docx?\\'" . "xdg-open %s"))
  :bind
  ("C-c a" . org-agenda)
  ("C-c c" . org-capture)
  ("C-c b" . org-switchb)
  ("C-c t" . org-toggle-link-display)
  ("C-c l" . org-store-link)
  :hook
  (org-mode . visual-line-mode))
(elpaca-wait)

(use-package ob-async
  :after org)

(use-package org-mac-link
  :after org)

(add-hook 'org-mode-hook (lambda ()
                           (define-key org-mode-map
                                       (kbd "C-c g") 'org-mac-link-get-link)))

(require 'org-inlinetask)

(use-package org-contrib
  :config
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines)))

(setq org-agenda-files '("~/Sync/org/inbox.org"
                         "~/Sync/org/recuerda.org"
                         "~/Sync/org/comisiones.org"
                         "~/Sync/org/inf-obs.org"
                         "~/Sync/org/fci.org"))
;; agenda en la ventana actual
(setq org-agenda-window-setup 'current-window)
;; avisa de tareas deadline en los próximos 7 días
(setq org-deadline-warning-days 7)
;; muestra tareas scheduled o deadline en los próximos 10 días
(setq org-agenda-span 10)
;; no muestra tareas scheduled si ya tienen fecha deadline
(setq org-agenda-skip-deadline-if-deadlline-is-shown t)
;; no colorea tareas con deadline inminente si ya son scheduled
(setq org-agenda-skip-deadline-prewarning-if-scheduled 'pre-scheduled)
;; no muestra tareas con fecha. implica que también ignora tareas
;; scheduled y deadlines
(setq org-agenda-todo-ignore-with-date t)

(setq org-agenda-custom-commands
      '(("h" "Agenda del día"
         ((agenda "" ((org-agenda-format-date "%a, %e %b %Y")))
          (alltodo "")))))

(use-package server
  :ensure nil
  :init
  (server-start))

(use-package exwm
  :config
  ;; Set the initial workspace number.
  (setq exwm-workspace-number 5)

  ;; When a windows class is updated, make class name the buffer name
  (add-hook 'exwm-update-class-hook
            (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
  (add-hook 'exwm-update-title-hook
            (lambda ()
              (when (or (not exwm-instance-name)
                        (string-prefix-p "sum-awt-x11-" exwm-instance-name)
                        (string= "gimp" exwm-instance-name))
                (exwm-workspace-rename-buffer exwm-class-name))))

  ;; Global keybindings.
  (setq exwm-input-global-keys
        '(([?\s-&] . (lambda (command)
                       (interactive (list (read-shell-command "$ ")))
                       (start-process-shell-command command nil command)))

          ;; 's-r': Reset (to line-mode).
          ([?\s-r] . exwm-reset)

          ;; Bind 's-w' to switch to workspace interactively.
          ([?\s-w] . exwm-workspace-switch)

          ;; managing windows
          ([s-left] . windmove-left)
          ([s-right] . windmove-right)
          ([s-up] . windmove-up)
          ([s-down] . windmove-down)

          ;; swaping windows
          ([s-S-left] . windmove-swap-states-left)
          ([s-S-right] . windmove-swap-states-right)
          ([s-S-up] . windmove-swap-states-up)
          ([s-S-down] . windmove-swap-states-down)

          ;; managing window sizes
          ([s-M-left] . enlarge-window-horizontally)
          ([s-M-right] . shrink-window-horizontally)
          ([s-M-up] . shrink-window)
          ([s-M-down] . enlarge-window)

          ;; managing workspaces
          ;; ([?\M-0] . exwm-workspace--switch-map 0)
          ;; ([?\M-1] . exwm-workspace--switch-map 1)
          ;; ([?\M-2] . exwm-workspace--switch-map 2)

          ;; Focus window
          ([?\s- ] . other-window)
          ([?\s-1] . select-window-1)
          ([?\s-2] . select-window-2)
          ([?\s-3] . select-window-3)
          ([?\s-4] . select-window-4)
          ([?\s-5] . select-window-5)
          ([?\s-6] . select-window-6)
          ([?\s-7] . select-window-7)
          ([?\s-8] . select-window-8)))
          ;; ([s-f11] . ammz/go-previous-workspace)
          ;; ([s-f12] . ammz/go-next-workspace)

          ;;             `(,(kbd (format "s-%d" i)) .
          ;;               (lambda ()
          ;;                 (interactive)
          ;;                 (exwm-workspace-switch-create ,i))))
          ;;           (number-sequence 0 9))

          ;; Controles de audio
          ;; ([XF86AudioMute] . (lambda () (interactive) (start-process-shell-command "Mute" nil "amixer -q set Master toggle")))
          ;; ([XF86AudioLowerVolume] . (lambda () (interactive) (start-process-shell-command "Decrease" nil "amixer -q set Master 5%-")))
          ;; ([XF86AudioRaiseVolume] . (lambda () (interactive) (start-process-shell-command "Increase" nil "amixer -q set Master 5%+")))
          ;; ([XF86AudioPlay] . (lambda () (interactive) (start-process-shell-command "Play" nil "playerctl play-pause")))
          ;; ([XF86AudioNext] . (lambda () (interactive) (start-process-shell-command "Next" nil "playerctl next")))
          ;; ([XF86AudioPrev] . (lambda () (interactive) (start-process-shell-command "Previous" nil "playerctl previous")))
          ;; ([XF86AudioStop] . (lambda () (interactive) (start-process-shell-command "Stop" nil "playerctl stop")))

  (exwm-enable))

;; Enable exwm-randr before exwm-init (post-init setup) gets called
(use-package exwm-randr
  :ensure nil
  ;; :if ammz/exwm-enabled
  :after (exwm)
  :config
  (setq exwm-randr-workspace-output-plist '(0 "eDP-1" 1 "DP-1"))
  (add-hook 'exwm-randr-screen-change-hook 'exwm-change-screen-hook)

  (add-hook 'exwm-randr-screen-change-hook
            (lambda ()
              (start-process-shell-command
               "xrandr" nil "xrandr --dpi 108 --output eDP-1 --off --output DP-1 --auto")))

  (defun exwm-change-screen-hook ()
    (let ((xrandr-output-regexp "\n\\([^ ]+\\) connected ")
          default-output)
      (with-temp-buffer
        (call-process "xrandr" nil t nil)
        (goto-char (point-min))
        (re-search-forward xrandr-output-regexp nil 'noerror)
        (setq default-output (match-string 1))
        (forward-line)
        (if (not (re-search-forward xrandr-output-regexp nil 'noerror))
            (call-process "xrandr" nil nil nil "--output" default-output "--auto")
          (call-process
           "xrandr" nil nil nil
           "--dpi 108"
           "--output" (match-string 1) "--primary" "--auto"
           "--output" default-output "--off")
          (setq exwm-randr-workspace-output-plist (list 0 (match-string 1)))))))

  (exwm-randr-enable))
