241009-version/emacs/config.org
*** Panel con Polybar

#+BEGIN_SRC emacs-lisp
  (defun ammz/run-in-background (command)
    (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))
#+END_SRC

Aplicaciones que se ejecutan por detrás

#+BEGIN_SRC emacs-lisp
  (ammz/run-in-background "nm-applet")
  ;; (ammz/run-in-background "pasystray")
  ;; (ammz/run-in-background "blueman-applet")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defvar ammz/polybar-process nil
    "Guarda el proceso de la instancia Polybar que se ejecuta, si existe")

  (defun ammz/kill-panel ()
    (interactive)
    (when ammz/polybar-process
      (ignore-errors
        (kill-process ammz/polybar-process)))
    (setq ammz/polybar-process nil))

  (defun ammz/start-panel ()
    (interactive)
    (ammz/kill-panel)
    (setq ammz/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

  ;; Configura el escritorio en la primera carga
  (add-hook 'exwm-init-hook #'ammz/start-panel)
#+END_SRC

**** Obteniendo información desde Emacs

Es necesaio que emacs-server esté activado.

#+begin_example
  emacsclient -e "exwm-workspace-current-index"
#+end_example

Definimos una función para llamar a los workspaces que queramos.

#+BEGIN_SRC emacs-lisp
  (defun ammz/polybar-exwm-workspace ()
    "Devuelve el icono de un workspace"
    (pcase exwm-workspace-current-index
      (0 "")
      (1 "")
      (2 "")
      (3 "")
      (4 "")))
#+END_SRC

**** Enviando información desde Emacs usando hooks

Usamos el comando =polybar-msg= para invocar un "hook index" para tener el módulo actualizado por sí mismo

#+BEGIN_SRC sh
  polybar-msg hook exwm 1
#+END_SRC

Hay que documentarse sobre el módulo IPC en la wiki de Polybar: https://github.com/polybar/wiki/Module:-ipc

***** Invocamos el hook desde dentro de Emacs

#+BEGIN_SRC emacs-lisp
  (defun ammz/send-polybar-hook (module-name hook-index)
    "Envía mensajes a polybar de tipo Hook para los módulos custom/ipc)"
    (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))

  (defun ammz/send-polybar-exwm-workspace ()
    (ammz/send-polybar-hook "exwm-workspace" 1))

  ;; Actualiza el indicador del planel cuando cambia el workspace
  (add-hook 'exwm-workspacee-switch-hook #'ammz/send-polybar-exwm-workspace)
#+END_SRC

** Configuración básica

Algunas variables a mi gusto.

*** Datos personales

Además de útil para la gestión del email, algunos modos pueden usar estos datos, como Org Mode.

#+BEGIN_SRC emacs-lisp
  (use-package startup
    :ensure nil
    :no-require t
    :custom
    (user-mail-address "antonio.moreno.m@juntadeandalucia.es")
    (user-full-name "Antonio Moreno"))
#+END_SRC

*** Directorio por defecto

#+BEGIN_SRC emacs-lisp
  ;; Directorio de inicio tras C-x C-f
  (setq default-directory "~/")
#+END_SRC

*** Actualiza el load-path

El directorio con el código lisp propio hay que incluirlo en el load-path.

#+BEGIN_SRC emacs-lisp
  (push "/Users/ammz/.config/emacs/lisp" load-path)
#+END_SRC

*** Backups

Colocamos los ficheros backup en un único directorio, en vez de estar repartidos por todas partes.

#+BEGIN_SRC emacs-lisp
  (use-package files
    :ensure nil
    :config
    (setq backup-directory-alist '(("." . "~/.config/emacs/backups/")))
    (setq create-lockfiles nil))
#+END_SRC

*** Más pequeños ajustes

- Responder solo con y/n
- Seguir enlaces sin preguntar
- Respuesta más rápida mostrando las combinaciones de teclas
- Permite ciertas acciones limitadas por Emacs
- Elimina los avisos sonoros
- No usar diálogos emergentes gráficos

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :ensure nil
    :init
    (setq frame-title-format '("%b -  %I"))
    (setq echo-keystrokes 0.25)           ; Muestra más rápido las combinaciones de teclas
    (setq auto-revert-verbose nil)        ; No muestra mensaje
    (setq ring-bell-function 'ignore)     ; Elimina los avisos sonoros
    (setq use-dialog-box nil)             ; Sin diálogos gráficos emergentes
  :config
    (defalias 'yes-or-no-p 'y-or-n-p)     ; Responder solo con y/n
    ;; Se permiten ciertas acciones limitadas por Emacs
    (put 'narrow-to-region 'disabled nil)
    (put 'upcase-region 'disabled nil)	; =C-x C-u=
    (put 'downcase-region 'disabled nil)	; =C-x C-l=
    (put 'dired-find-alternate-file 'disabled nil))
#+END_SRC

*** Custom.el

Almacenamos en un fichero separado el código elisp que Emacs añade al instalar algunos paquetes o usar los interfaces de configuración.

#+BEGIN_SRC emacs-lisp
  (use-package cus-edit
    :ensure nil
    :config
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    (unless (file-exists-p custom-file)
      (make-empty-file custom-file))
    (load custom-file 'noerror 'nomessage))
#+END_SRC

*** Registro del histórico
**** Recentf (ficheros y directorios recientes)

Este modo realiza un seguimiento de los ficheros que teníamos abiertos, permitiendo volver a ellos rápidamente.

#+BEGIN_SRC emacs-lisp
  (use-package recentf
    :ensure nil
    :config
    (setq recentf-save-file (expand-file-name "recentf" user-emacs-directory))
    (setq recentf-max-menu-items 10)
    (setq recentf-exclude '(".gz" ".xz" ".zip" "/elpa/" "/ssh:" "/sudo:"))
    :hook (after-init . recentf-mode))
#+END_SRC

**** Minibuffer

Mantiene un registro de las acciones del minibuffer

#+BEGIN_SRC emacs-lisp
  (use-package savehist
    :ensure nil
    :config
    (setq savehist-file (expand-file-name "savehist" user-emacs-directory))
    (setq savehist-save-minibuffer-history t)
    (setq history-length 25)
    (savehist-mode 1))
#+END_SRC

**** Posición del cursor

Recuerda donde están los /points/ en cualquier fichero.

#+BEGIN_SRC emacs-lisp
  (use-package saveplace
    :ensure nil
    :config
    (setq save-place-file (expand-file-name "saveplace" user-emacs-directory))
    (save-place-mode 1))
#+END_SRC

*** Selección

Este modo elimina la región marcada cuando se escribe directamente sobre ella.

#+BEGIN_SRC emacs-lisp
  (use-package delsel
    :ensure nil
    :hook (after-init . delete-selection-mode))
#+END_SRC

*** Refresca los buffers si cambian los ficheros

Emacs no refresca los buffers de un fichero cuando el fichero ha sido cambiado fuera de Emacs. Esto ocurre cuando se usan herramientas que generan algún tipo de fichero de texto que estamos leyendo en Emacs.

#+BEGIN_SRC emacs-lisp
  (use-package autorevert
    :ensure nil
    :config
    (global-auto-revert-mode 1)
    (setq global-auto-revert-non-file-buffers nil))
#+END_SRC

** Fuentes

#+begin_src emacs-lisp
  (let ((screen-width (x-display-pixel-width))
        (screen-height (x-display-pixel-height)))
    (if (>= screen-width 3840)
        (setq font-size 145)
      (setq font-size 95))
    (set-face-attribute 'default nil :family "Iosevka Comfy" :weight 'normal :height font-size))

  (set-face-attribute 'variable-pitch nil :family "Iosevka Comfy Motion Duo" :height 1.0)
  (set-face-attribute 'fixed-pitch nil :family "Iosevka Nerd Font" :height 1.0)
#+end_src

#+RESULTS:

** Configuración de la interfaz
*** Sin pantalla de inicio

Eliminamos la pantalla de Emacs muestra cuando se inicia sin un fichero.

#+BEGIN_SRC emacs-lisp
  (use-package startup
    :ensure nil
    :no-require t
    :config
    (setq inhibit-startup-screen t))
#+END_SRC

*** Mostramos las líneas con saltos por palabras

#+begin_src emacs-lisp
  (use-package startup
    :ensure nil
    :no-require t
    :config
    (global-visual-line-mode 1))
#+end_src

*** Números de líneas / Caracteres invisibles

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :ensure nil
    :config
    (defun prot/toggle-line-numbers ()
      "Toggles the display of line numbers.  Applies to all buffers."
      (interactive)
      (if (bound-and-true-p display-line-numbers-mode)
          (display-line-numbers-mode -1)
        (display-line-numbers-mode)))

    (defun prot/toggle-invisibles ()
      "Toggles the display of indentation and space characters."
      (interactive)
      (if (bound-and-true-p whitespace-mode)
          (whitespace-mode -1)
        (whitespace-mode)))
    :bind (("<f7>" . prot/toggle-line-numbers)
           ("<f8>" . prot/toggle-invisibles)))
#+END_SRC

*** Delimitadores resaltados

#+BEGIN_SRC emacs-lisp
  (use-package paren
    :ensure nil
    :config
    (show-paren-mode)
    :custom
    (show-paren-style 'mixed))
#+END_SRC

*** Configuración del modeline
**** Hora 

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :ensure nil
    :config
    (setq display-time-24hr-format t)
    (display-time))
#+END_SRC

**** Iconos

#+BEGIN_SRC emacs-lisp
  (use-package nerd-icons
    :custom
    ;; The Nerd Font you want to use in GUI
    ;; "Symbols Nerd Font Mono" is the default and is recommended
    ;; but you can use any other Nerd Font if you want
    (nerd-icons-font-family "Symbols Nerd Font Mono")
    )
#+END_SRC

**** doom-modeline

#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode 1))
#+END_SRC

*** Cursor

Usamos el cursor tipo barra (|) en la ventana activa y el tipo hollow en las demás

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :ensure nil
    :config
    (setq-default cursor-type '(bar . 4))
    (setq-default cursor-face-highlight-mode 1)
    (setq-default cursor-in-non-selected-windows 'hollow)
    (setq x-stretch-cursor nil))
#+END_SRC

*** Manejo de las ventanas
