241009-version/emacs/init.el

(use-package window-numbering
  :init
  (setq window-numbering-keymap
    (let ((map (make-sparse-keymap)))
      (define-key map (kbd "M-0") 'select-window-0)
      (define-key map (kbd "M-1") 'select-window-1)
      (define-key map (kbd "M-2") 'select-window-2)
      (define-key map (kbd "M-3") 'select-window-3)
      (define-key map (kbd "M-4") 'select-window-4)
      (define-key map (kbd "M-5") 'select-window-5)
      (define-key map (kbd "M-6") 'select-window-6)
      (define-key map (kbd "M-7") 'select-window-7)
      (define-key map (kbd "M-8") 'select-window-8)
      (define-key map (kbd "M-9") 'select-window-9)
      map))
  :config
  (window-numbering-mode))

(use-package winner
  :ensure nil
  :config (winner-mode))

(use-package help
  :ensure nil
  :custom (help-window-select t))

(use-package olivetti)

(use-package emacs
  :ensure nil
  :init
  (setq modus-themes-mode-line '(accented borderless)
        modus-themes-region '(bg-only)
        modus-themes-fringes nil
        modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-tabs-accented t
        modus-themes-paren-match '(bold intense)
        modus-themes-prompts '(bold intense) 
        modus-themes-org-blocks 'tinted-background
        modus-themes-scale-headings t
        modus-themes-headings
        '((1 . (rainbow overline background 1.05))
          (2 . (rainbow background 1.05))
          (3 . (rainbow bold 1.0))
          (4 . (rainbow 1.0))))
  :config
  (load-theme 'modus-vivendi t)
  :bind ("<f5>" . modus-themes-toggle))

(use-package mu4e 
  :ensure nil
  :config
  ;; This is set to 't' to avoid mail syncing issues when using mbsync
  (setq mu4e-change-filenames-when-moving t)

  ;; Refresh mail using isync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/.mail/junta")

  (setq mu4e-drafts-folder "/Drafts")
  (setq mu4e-sent-folder   "/Sent")
  (setq mu4e-trash-folder  "/Trash")

  (setq mu4e-maildir-shortcuts
        '((:maildir "/Inbox"     :key ?i)
          (:maildir "/Sent"      :key ?s)
          (:maildir "/Trash"     :key ?t)
          (:maildir "/Drafts"    :key ?d)))

  (setq mu4e-headers-fields
        '((:human-date . 12)
          (:flags . 10)
          (:from-or-to . 72)
          ;; (:mailing-list . 10)
          (:thread-subject)))

   (add-to-list 'mu4e-bookmarks
     ;; add bookmark for not trashed messages
     '( :name "Inbox"
        :key  ?m
        :query "maildir:/inbox AND NOT flag:trashed"))

  (defun ammz-mu4e-headers-function ()
    (visual-line-mode -1)
    (toggle-truncate-lines 1))

  :hook
  (mu4e-headers-mode . ammz-mu4e-headers-function)

  :custom
  (mu4e-use-fancy-chars t))

(use-package perspective
  :bind
  ("C-x C-b" . persp-list-buffers)
  ;; (consult-customize consult--source-buffer :hidden t :default nil)
  ;; (add-to-list 'consult-buffer-sources persp-consult-source)
  :custom
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :init
  (persp-mode t))

(use-package helpful
  :config
  ;; Note that the built-in `describe-function' includes both functions
  ;; and macros. `helpful-function' is functions only, so we provide
  ;; `helpful-callable' as a drop-in replacement.
  (global-set-key (kbd "C-h f") #'helpful-callable)
  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)
  (global-set-key (kbd "C-h x") #'helpful-command)

  ;; Lookup the current symbol at point. C-c C-d is a common keybinding
  ;; for this in lisp modes.
  (global-set-key (kbd "C-c C-d") #'helpful-at-point)
  ;; Look up *F*unctions (excludes macros).
  ;;
  ;; By default, C-h F is bound to `Info-goto-emacs-command-node'. Helpful
  ;; already links to the manual, if a function is referenced there.
  (global-set-key (kbd "C-h F") #'helpful-function))

(use-package pdf-tools
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :magic ("%PDF" . pdf-view-mode))

(when (eq system-type 'darwin)
  (require 'ls-lisp)
  (setq insert-directory-program "/usr/local/bin/gls"))

(use-package dired
  :ensure nil
  :config
  (setq dired-dwim-target t)
  (setq dired-listing-switches "-al --group-directories-first")
  :bind (:map dired-mode-map
              ("b" . dired-up-directory))
  :hook (dired-mode . dired-hide-details-mode))

(use-package dired-subtree
  :after dired
  :bind (:map dired-mode-map
              ("<tab>" . dired-subtree-toggle)
              ("<S-tab>" . dired-subtree-remove)))

(use-package nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package origami
  :bind ("C-c o" . origami-toggle-node)
  :hook (python-mode . origami-mode))

(use-package htmlize)

(use-package dockerfile-mode)

(use-package vertico
  :demand t
  :config (vertico-mode 1))

(use-package orderless
  :after vertico
  :config
  (setq completion-styles '(orderless basic partial-completion)
        completion-category-default nil))

(use-package marginalia
  :config
  ;; (setq marginalia-annotators
  ;;       '(marginalia-annotators-heavy
  ;;         marginalia-annotators-light))
  (marginalia-mode 1))

(use-package consult
  ;; :demand
  :config
  ;; (setq consult-line-numbers-widen t)
  (setq completion-in-region-function #'consult-completion-in-region)
  ;; (setq consult-async-input-debounce 0.5)
  ;; (setq consult-async-input-throttle 0.8)
  ;; (setq consult-narrow-key ">")
  ;; (setq consult-widen-key "<")
  :bind (("M-X" . consult-mode-command)
         ("M-y" . consult-yank-from-kill-ring)
         ("C-x b" . consult-buffer)
         ("M-s m" . consult-mark)
         :map consult-narrow-map
         ("?" . consult-narrow-help)
         :map minibuffer-local-completion-map
         ("<tab>" . minibuffer-force-complete)))
