241009-version/emacs/config.org
*** Embark

#+BEGIN_SRC emacs-lisp
  (use-package embark
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)

    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Consult users will also want the embark-consult package.
  (use-package embark-consult
    :after (embark consult)
    :demand t ; only necessary if you have the hook below
    ;; if you want to have consult previews as you move around an
    ;; auto-updating embark collect buffer
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+END_SRC

*** Completado de expresiones

En Emacs podemos usar distintas formas para completar expresiones:
- =completion-at-point=: Es método nativo en Emacs
- =auto-complete=: disponible en MELPA.
- =company-mode=: 
- corfu: este es el usaremos

**** Corfu
#+BEGIN_SRC emacs-lisp
  (use-package corfu
   ;; Optional customizations
    :custom
    (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    (corfu-auto t)                 ;; Enable auto completion
    ;; (corfu-separator ?\s)          ;; Orderless field separator
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
    ;; (corfu-scroll-margin 5)        ;; Use scroll margin

    ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
    ;; be used globally (M-/).  See also the customization variable
    ;; `global-corfu-modes' to exclude certain modes.
    :init
    (global-corfu-mode))
#+END_SRC


**** Cape
#+BEGIN_SRC emacs-lisp
  (use-package cape
    ;; Bind prefix keymap providing all Cape commands under a mnemonic key.
    ;; Press C-c p ? to for help.
    :bind ("C-c p" . cape-prefix-map) ;; Alternative keys: M-p, M-+, ...
    ;; Alternatively bind Cape commands individually.
    ;; :bind (("C-c p d" . cape-dabbrev)
    ;;        ("C-c p h" . cape-history)
    ;;        ("C-c p f" . cape-file)
    ;;        ...)
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-keyword)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    ;; (add-hook 'completion-at-point-functions #'cape-history)
    ;; ...
  )
#+END_SRC
**** COMMENT Company mode

#+BEGIN_SRC emacs-lisp
  (use-package company
    :config
    (setq company-idle-delay 0.1
          company-minimum-prefix-length 1)
    :hook (after-init . global-company-mode))
#+END_SRC


** COMMENT Para tomar notas

#+BEGIN_SRC emacs-lisp
  (use-package denote
    :init
    (require 'denote-org-dblock)
    (denote-rename-buffer-mode 1)
    :custom
    (denote-directory "~/Sync/notas")
    :hook
    (dired-mode . denote-dired-mode)
    :custom-face
    (denote-faces-link ((t (:slant italic)))))

  ;; Denote extensions
  (use-package consult-notes
    :commands (consult-notes
               consult-notes-search-in-all-notes)
    :custom
    (consult-notes-file-dir-sources
     `(("Denote" ?d ,denote-directory))))
#+END_SRC

** Utilidades para programar
*** Magit (Interfaz para Git)

**** Transient

Librería que implementa los menús por teclado. Hay que actualizar la versión que viene por defecto en emacs para que funcione la instalación de Magit.

#+BEGIN_SRC emacs-lisp
  (use-package transient)
#+END_SRC

**** Magit

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :bind ("C-x g" . magit-status)
    :after transient)
#+END_SRC

*** Edit server (edita formularios web en emacs)

#+BEGIN_SRC emacs-lisp
    (use-package edit-server)
#+END_SRC

*** Treesitter

#+BEGIN_SRC emacs-lisp

  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (typst "https://github.com/uben0/tree-sitter-typst")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

  (setq major-mode-remap-alist
        '((c-mode . c-ts-mode)
          (c++-mode . c++-ts-mode)))
          ;; (yaml-mode . yaml-ts-mode)
          ;; (bash-mode . bash-ts-mode)
          ;; (c-or-c++-mode . c-or-c++-ts-mode)
          ;; (js2-mode . js-ts-mode)
          ;; (typescript-mode . typescript-ts-mode)
          ;; (json-mode . json-ts-mode)
          ;; (css-mode . css-ts-mode)
          ;; (python-mode . python-ts-mode)))

#+END_SRC

*** COMMENT IDE (lsp)
**** COMMENT lsp-mode

#+BEGIN_SRC emacs-lisp

    (use-package emacs
      :config
      (setq lsp-clients-clangd-executable "/usr/local/opt/llvm/bin/clangd")
      (setq lsp-clients-clangd-args '("-j=4" "-background-index" "-log=info" "-pretty")))

    (defun efs/lsp-mode-setup ()
      (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
      (lsp-headerline-breadcrumb-mode))


    (use-package lsp-mode
      :straight t
      :commands (lsp lsp-deferred)
      :hook ((lsp-mode . efs/lsp-mode-setup)
             (clojure-mode . lsp)
             (clojurec-mode . lsp)
             (clojurescript-mode . lsp)
             (haskell-mode . lsp))
      :init
      (setq lsp-keymap-prefix "C-c l")
      :config
      (setq lsp-enable-which-key-integration t)
      ;; add paths to your local installation of project mgmt tools, like lein
      (setenv "PATH" (concat
                       "/usr/local/bin" path-separator
                       (getenv "PATH")))
      (dolist (m '(clojure-mode
                   clojurec-mode
                   clojurescript-mode
                   clojurex-mode))
         (add-to-list 'lsp-language-id-configuration `(,m . "clojure")))
      (setq lsp-clojure-server-command '("/usr/local/bin/clojure-lsp"))) ;; Optional: In case `clojure-lsp` is not in your $PATH

#+END_SRC

**** COMMENT lsp-ui

#+BEGIN_SRC emacs-lisp
  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+END_SRC

**** COMMENT lsp-treemacs

#+BEGIN_SRC emacs-lisp
  (use-package lsp-treemacs
    :straight t
    :after lsp)
#+END_SRC

*** COMMENT Docker

#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode)
  (use-package docker-compose-mode)
#+END_SRC

*** Herramientas de programación
**** Flycheck

#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :defer t)
  (add-hook 'prog-mode-hook 'flycheck-mode)
#+END_SRC

**** Projectile

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :config
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map))
#+END_SRC

*** COMMENT Debugging DAP mode

No es compatible con Eglot. (solo con LSP)


#+BEGIN_SRC emacs-lisp

  (use-package dap-mode
      :config
      (dap-auto-configure-mode)
      :bind
      (("<M-f7>" . dap-step-in)
       ("<M-f8>" . dap-next)
       ("<M-f9>" . dap-continue)))

  ;; (require 'dap-firefox)

#+END_SRC

*** COMMENT Debugging Dape

#+BEGIN_SRC emacs-lisp

(use-package dape)

#+END_SRC

*** COMMENT ESS

#+BEGIN_SRC emacs-lisp
  (use-package ess
    :straight t
    )
#+END_SRC

*** COMMENT Yasnippets

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :straight t
    :config
    (yas-reload-all)
    (yas-global-mode))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet-snippets
    :straight t)
#+END_SRC

*** COMMENT EditorConfig

#+BEGIN_SRC emacs-lisp
  (use-package editorconfig
    :straight t
    :config
    (editorconfig-mode 1))
#+END_SRC

** Relativo a los lenguajes
