241009-version/emacs/config.org
*** COMMENT C++

Modern C++ code highlighting

#+BEGIN_SRC emacs-lisp

  (use-package modern-cpp-font-lock
    :straight t
    :init
    (eval-when-compile
      ;; Silence missing function warnings
      (declare-function modern-c++-font-lock-global-mode
                        "modern-cpp-font-lock.el"))
    :config
    (modern-c++-font-lock-global-mode t)
    )

#+END_SRC

Cofiguramos cc-mode

#+BEGIN_SRC emacs-lisp
  (defvar my:compile-command "clang++ -std=c++20")
  (use-package cc-mode
    :init
    (add-to-list 'auto-mode-alist '("\\.tpp\\'" . c++-mode))
    (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
    (add-to-list 'auto-mode-alist '("\\.hpp\\'" . c++-mode))
    (add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
    :config
    (define-key c++-mode-map (kbd "C-c C-c") 'compile)
    (define-key c++-mode-map (kbd "C-c C-k") 'kill-compilation)
    (setq compile-command my:compile-command)

    (use-package google-c-style
      :straight t
      :config
      ;; This prevents the extra two spaces in a namespace that Emacs
      ;; wise wants to put... Gawd!
      (add-hook 'c-mode-common-hook 'google-set-c-style)
      ;; Autoindent using google style guide
      (add-hook 'c-mode-common-hook 'google-make-newline-indent)
      )
    )
#+END_SRC

*** COMMENT Clojure

#+BEGIN_SRC emacs-lisp
  (use-package cider
    :straight t
    :init
    (setq cider-repl-display-help-banner nil)
    :config
    (add-hook 'cider-repl-mode-hook #'company-mode)
    (add-hook 'cider-mode-hook #'company-mode))
  (use-package clojure-mode
    :straight t)

#+END_SRC

*** COMMENT CSS

#+BEGIN_SRC emacs-lisp
  (use-package css-mode
    :config
    (setq css-fontify-colors nil))
#+END_SRC

*** COMMENT css / scss

#+BEGIN_SRC emacs-lisp
  (use-package sass-mode
    :straight t
    :mode ("\\.sass$" . sass-mode))
#+END_SRC

*** Ditaa

#+BEGIN_SRC emacs-lisp
  (setq org-ditaa-jar-path "/usr/share/java/ditaa/ditaa-0.11.jar")
#+END_SRC

*** COMMENT Django

#+BEGIN_SRC emacs-lisp
  (use-package lsp-pyright
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp))))  ; or lsp-deferred
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package django-mode)
#+END_SRC

*** COMMENT Elm

#+BEGIN_SRC emacs-lisp
  (use-package elm-mode
    :straight t)
#+END_SRC

*** Haskell

#+BEGIN_SRC emacs-lisp

  (use-package haskell-mode)

  ;; (require 'haskell-interactive-mode)
  ;; (require 'haskell-process)
  ;; (setq haskell-process-type 'stack-ghci)
  ;; (require 'ob-haskell)
  ;; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; (use-package lsp-haskell)
#+END_SRC

*** COMMENT Html

#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :straight t
    :mode ("\\.html$" . web-mode)
    :init (setq web-mode-markup-indent-offset 2))
#+END_SRC

Para previsualilzar en una navegador el buffer con html

#+BEGIN_SRC emacs-lisp
    (with-eval-after-load 'web-mode
      (define-key web-mode-map (kbd "C-c C-v") 'browse-url-of-buffer))
#+END_SRC

*** Hugo
**** Deshabilitando el caché

Esto es necesario para que funcione de forma fluida la exportación de ox-hugo. (recomendado en [[https://github.com/kaushalmodi/ox-hugo/discussions/551]])

#+BEGIN_SRC emacs-lisp
  (setq org-element-use-cache nil)
#+END_SRC

**** ox-hugo

#+BEGIN_SRC emacs-lisp
  (use-package ox-hugo
    :config
    (with-eval-after-load 'ox
      (require 'ox-hugo))
    )
#+END_SRC

***** COMMENT Plantilla para capturar nueva entrada

#+BEGIN_SRC emacs-lisp
  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
  See `org-capture-templates' for more information."
    (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
           (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
           (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "* " title)
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_HUGO_BUNDLE: " fname)
                   ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
                   ":END:"
                   "#+BEGIN_SRC yaml :front_matter_extra t"
                   "portada: 's'"
                   "resources:"
                   "  - src: "
                   "#+END_SRC"
                   "%?\n")                ;Place the cursor here finally
                 "\n")))
#+END_SRC

*** JavaScript

#+BEGIN_SRC emacs-lisp

  (setq js-indent-level 2)
  ;; (add-hook js-mode-hook #'eglot)

#+END_SRC
*** COMMENT Json

#+BEGIN_SRC emacs-lisp
  (use-package json-mode
    :straight t)
#+END_SRC

*** COMMENT Lisp
**** COMMENT slime

#+BEGIN_SRC emacs-lisp
  (use-package slime
    :config (setq inferior-lisp-program "sbcl"))
#+END_SRC

**** sly

#+BEGIN_SRC emacs-lisp
  (use-package sly
    :init
    (setq inferior-lisp-program "sbcl")
    (setq sly-default-lisp 'sbcl)
    (setq org-babel-lisp-eval-fn 'sly-eval))
#+END_SRC

*** COMMENT Lua

#+BEGIN_SRC emacs-lisp
  (use-package lua-mode
    :straight t)
#+END_SRC

*** Markdown

#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
    :config
    (setq markdown-fontify-code-blocks-natively t)
    :mode ("\\.md$" . markdown-mode))
#+END_SRC

*** COMMENT Ocaml

#+BEGIN_SRC emacs-lisp
  (use-package tuareg)
  (use-package dune)

  ;; Después de instalar merlin
  (let ((opam-share (ignore-errors (car (process-lines "opam" "var" "share")))))
    (when (and opam-share (file-directory-p opam-share))
      ;; Register Merlin
      (add-to-list 'load-path (expand-file-name "emacs/site-lisp" opam-share))
      (autoload 'merlin-mode "merlin" nil t nil)
      ;; Automatically start it in OCaml buffers
      (add-hook 'tuareg-mode-hook 'merlin-mode t)
      (add-hook 'caml-mode-hook 'merlin-mode t)
      ;; Use opam switch to lookup ocamlmerlin binary
      (setq merlin-command 'opam)
      ;; To easily change opam switches within a given Emacs session, you can
      ;; install the minor mode https://github.com/ProofGeneral/opam-switch-mode
      ;; and use one of its "OPSW" menus.
      ))

#+END_SRC

Configuración de algunas variables para su uso con OCaml y OPAM. Son el resultado de ejecutar =opam user-setup install=.

#+BEGIN_SRC emacs-lisp

  ;; Generic, recommended configuration options
  (custom-set-variables
   '(indent-tabs-mode nil)
   '(compilation-context-lines 2)
   '(compilation-error-screen-columns nil)
   '(compilation-scroll-output t)
   '(compilation-search-path (quote (nil "src")))
   '(electric-indent-mode nil)
   '(next-line-add-newlines nil)
   '(require-final-newline t)
   '(sentence-end-double-space nil)
   '(show-trailing-whitespace nil)
   '(visible-bell t)                      ; Fogonazos en vez del timbre
   ;; '(show-paren-mode t)                   ; Configurado específicamente
   '(next-error-highlight t)
   '(next-error-highlight-no-select t)
   '(backup-directory-alist '(("." . "~/.local/share/emacs/backups")))
   '(ac-use-fuzzy nil)
   '(line-move-visual t)
   )

  ;; ANSI color in compilation buffer
  (require 'ansi-color)
  (defun colorize-compilation-buffer ()
    (toggle-read-only)
    (ansi-color-apply-on-region (point-min) (point-max))
    (toggle-read-only))
  (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)

  ;; Some key bindings

  ;; (global-set-key [f3] 'next-match)
  (defun prev-match () (interactive nil) (next-match -1))
  (global-set-key [(shift f3)] 'prev-match)
  (global-set-key [backtab] 'auto-complete)
  ;; OCaml configuration
  ;;  - better error and backtrace matching

  (defun set-ocaml-error-regexp ()
    (set
     'compilation-error-regexp-alist
     (list '("[Ff]ile \\(\"\\(.*?\\)\", line \\(-?[0-9]+\\)\\(, characters \\(-?[0-9]+\\)-\\([0-9]+\\)\\)?\\)\\(:\n\\(\\(Warning .*?\\)\\|\\(Error\\)\\):\\)?"
      2 3 (5 . 6) (9 . 11) 1 (8 compilation-message-face)))))

  (add-hook 'tuareg-mode-hook 'set-ocaml-error-regexp)
  (add-hook 'caml-mode-hook 'set-ocaml-error-regexp)
  ;; ## added by OPAM user-setup for emacs / base ## 56ab50dc8996d2bb95e7856a6eddb17b ## you can edit, but keep this line
  (require 'opam-user-setup "~/.config/emacs/opam-user-setup.el")
  ;; ## end of OPAM user-setup addition for emacs / base ## keep this line

#+END_SRC

**** COMMENT Todavía no comprobado
#+BEGIN_SRC emacs-lisp

  (use-package direnv
    :straight t)

  (use-package tuareg
    :straight t
    :mode ("\\.ocamlinit\\'" . tuareg-mode))

  (use-package dune
    :straight t)

  (use-package merlin
    :straight t
    :config
    (add-hook 'tuareg-mode-hook #'merlin-mode)
    (add-hook 'merlin-mode-hook #'company-mode)
    ;; we're using flycheck instead
    (setq merlin-error-after-save nil))

  (use-package merlin-eldoc
    :straight t
    :hook ((tuareg-mode) . merlin-eldoc-setup))

  ;; This uses Merlin internally
  (use-package flycheck-ocaml
    :straight t
    :config
    (add-hook 'tuareg-mode-hook
              (lambda ()
                ;; disable Merlin's own error checking
                (setq-local merlin-error-after-save nil)
                ;; enable Flycheck checker
                (flycheck-ocaml-setup))))

  (use-package utop
    :straight t
    :config
    (autoload 'utop "utop" "Toplevel for OCaml" t)
    (add-hook 'utop-mode-hook #'company-mode)
    (add-hook 'tuareg-mode-hook #'utop-minor-mode))

  ;; (let ((opam-share (ignore-errors (car (process-lines "opam" "var" "share")))))
  ;;   (when (and opam-share (file-directory-p opam-share))
  ;;     ;; Register Merlin
  ;;     (add-to-list 'load-path (expand-file-name "emacs/site-lisp" opam-share))
  ;;     (autoload 'merlin-mode "merlin" nil t nil)
  ;;     ;; Automatically start it in OCaml buffers
  ;;     (add-hook 'tuareg-mode-hook 'merlin-mode t)
  ;;     (add-hook 'caml-mode-hook 'merlin-mode t)
  ;;     ;; Use opam switch to lookup ocamlmerlin binary
  ;;    (setq merlin-command 'opam)))

  ;; (require 'ocp-indent)
  ;;
  ;; (use-package ocamlformat
  ;;   :custom (ocamlformat-enable 'enable-outside-detected-project)
  ;;   :hook (before-save . ocamlformat-before-save))

#+END_SRC

*** COMMENT Php

#+BEGIN_SRC emacs-lisp
  (use-package php-mode
    :straight t
    :mode ("\\.php$" . php-mode)
    :init
    (setq php-mode-coding-style (quote psr2))
    (setq php-search-documentation-browser-function 'eww-browse-url)
    (setq php-style-delete-trailing-whitespace 1)
    )
#+END_SRC

*** COMMENT Python

#+BEGIN_SRC emacs-lisp
  (use-package python-ts-mode
    :ensure nil
    :hook ((python-ts-mode . eglot-ensure)
           (python-ts-mode . company-mode))
    :bind (:map python-ts-mode-map
                ("<f9> . recompile")
                ("<f10> . eglot-format"))
    :mode (("\\.py\\'" . python-ts-mode)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
    (use-package conda
      :config
      (setq conda-env-home-directory
            (expand-file-name "~/miniconda")))
#+END_SRC

*** COMMENT Python

La principal herramienta que uso para trabajar con python es Elpy.

#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :defer
    :init
    (advice-add 'python-mode :before 'elpy-enable)
    ;; Se deshabilita flymake. Se usará flycheck.
    (remove-hook 'elpy-modules 'elpy-module-flymake))
#+END_SRC

*** COMMENT Racket

#+BEGIN_SRC emacs-lisp
  (use-package racket-mode
    :mode "\\.rkt\\'")
#+END_SRC

*** COMMENT Rust

#+BEGIN_SRC emacs-lisp
  (use-package rustic
    :config
    (setq rustic-format-on-save t
          rustic-cargo-bin-remote "/usr/local/cargo/bin/cargo"
          rustic-compile-command-remote "/usr/local/cargo/bin/cargo"
          rustic-rustfmt-bin-remote "/usr/local/cargo/bin/rustfmt"
          rustic-lsp-client 'eglot)
    :custom
    (add-to-list 'tramp-remote-path "/usr/local/perl/bin")
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    (lsp-rust-analyzer-server-display-inlay-hints t)
    :mode ("\\.rs" . rustic-mode))
#+END_SRC

*** Scheme (variantes)

#+BEGIN_SRC emacs-lisp
  (require 'xscheme)
#+END_SRC

**** Guile

#+BEGIN_SRC emacs-lisp
  (use-package geiser-guile)
#+END_SRC

**** mit-scheme

#+BEGIN_SRC emacs-lisp
  (use-package geiser-mit)
#+END_SRC

*** COMMENT Sml

#+BEGIN_SRC emacs-lisp
  (use-package sml-mode
    :mode "\\.sml\\'")
#+END_SRC

*** COMMENT Typoscript

#+BEGIN_SRC emacs-lisp
  (use-package typoscript-mode
    :straight t
    :mode ("\\.typoscript" . typoscript-mode))
#+END_SRC

*** typst
#+BEGIN_SRC emacs-lisp

  (use-package typst-ts-mode
    :ensure (:host sourcehut :repo "meow_king/typst-ts-mode" :files (:defaults "*.el"))
    :custom
    (typst-ts-mode-watch-options "--open")
    ;; (optional) checking typst grammar version needs it
    (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory)))

#+END_SRC
*** YAML

#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :mode (("\\.yml$" . yaml-mode)
           ("\\.yaml$" . yaml-mode)))
#+END_SRC

