241009-version/emacs/init.el

(setq org-ditaa-jar-path "/usr/share/java/ditaa/ditaa-0.11.jar")

(use-package haskell-mode)

;; (require 'haskell-interactive-mode)
;; (require 'haskell-process)
;; (setq haskell-process-type 'stack-ghci)
;; (require 'ob-haskell)
;; (add-hook 'haskell-mode-hook 'interactive-haskell-mode)

;; (use-package lsp-haskell)

(setq org-element-use-cache nil)

(use-package ox-hugo
  :config
  (with-eval-after-load 'ox
    (require 'ox-hugo))
  )

(setq js-indent-level 2)
;; (add-hook js-mode-hook #'eglot)

(use-package sly
  :init
  (setq inferior-lisp-program "sbcl")
  (setq sly-default-lisp 'sbcl)
  (setq org-babel-lisp-eval-fn 'sly-eval))

(use-package markdown-mode
  :config
  (setq markdown-fontify-code-blocks-natively t)
  :mode ("\\.md$" . markdown-mode))

(require 'xscheme)

(use-package geiser-guile)

(use-package geiser-mit)

(use-package typst-ts-mode
  :ensure (:host sourcehut :repo "meow_king/typst-ts-mode" :files (:defaults "*.el"))
  :custom
  (typst-ts-mode-watch-options "--open")
  ;; (optional) checking typst grammar version needs it
  (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory)))

(use-package yaml-mode
  :mode (("\\.yml$" . yaml-mode)
         ("\\.yaml$" . yaml-mode)))

(use-package emacs
  :ensure nil
  :config
