241009-version/emacs/init.el
  (setq system-time-locale "es_ES.UTF-8"))

(use-package parse-time
  :ensure nil
  :defer t
  :config
  (setq parse-time-months 
        (append '(("ene" . 1) ("feb" . 2) ("mar" . 3)
                  ("abr" . 4) ("may" . 5) ("jun" . 6)
                  ("jul" . 7) ("ago" . 8) ("sep" . 9)
                  ("oct" . 10) ("nov" . 11) ("dic" . 12)
                  ("enero" . 1) ("febrero" . 2)
                  ("marzo" . 3) ("abril" . 4) ("junio" . 6)
                  ("julio" . 7) ("agosto" . 8)
                  ("septiembre" . 9) ("octubre" . 10)
                  ("noviembre" . 11) ("diciembre" . 12))
                parse-time-months))
  (setq parse-time-weekdays
        (append '(("dom" . 0) ("lun" . 1) ("mar" . 2)
                  ("mié" . 3) ("jue" . 4) ("vie" . 5)
                  ("sáb" . 6) ("domingo" . 0) ("lunes" . 1)
                  ("martes" . 2) ("miércoles" . 3)
                  ("jueves" . 4) ("viernes" . 5)
                  ("sábado" . 6))
                parse-time-weekdays)))

(use-package calendar
  :ensure nil
  :custom
  (calendar-week-start-day 1)
  (calendar-day-name-array ["Domingo" "Lunes" "Martes" "Miércoles"
                            "Jueves" "Viernes" "Sábado"])
  (calendar-day-abbrev-array ["Dom" "Lun" "Mar" "Mié" "Jue" "Vie" "Sáb"])
  (calendar-day-header-array ["Do" "Lu" "Ma" "Mi" "Ju" "Vi" "Sá"])
  (calendar-month-name-array ["Enero" "Febrero" "Marzo" "Abril" "Mayo"
                              "Junio" "Julio" "Agosto" "Septiembre"
                              "Octubre" "Noviembre" "Diciembre"])
  (calendar-month-abbrev-array ["Ene" "Feb" "Mar" "Abr" "May" "Jun"
                                "Jul" "Ago" "Sep" "Oct" "Nov" "Dic"]))
